# ResultType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidCurveIntersection..::..ResultType Property
SolidCurveIntersection Class See Also
---
The result type used to calculate the intersections.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SolidCurveIntersectionMode ResultType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ResultType As SolidCurveIntersectionMode
	Get
```

Visual C++
---
```text
public:
property SolidCurveIntersectionMode ResultType {
	SolidCurveIntersectionMode get ();
}
```

# See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace